load U.mat
%相机内参

%K=[2676.18,0,839.687
%0,2675.14,600.369
%0,0,1];%1600*1200

K=[23081.52051356826, 0, 1700.7332143516;
 0, 23127.11282656558, 1581.667696183099;
 0, 0, 1];%4912*3684

import comEX.*;

[Y,m]=pca1(U);%pca主成分分析

%%Y 计算所得空间系列圆心的方向向量即转轴的方向向量
%%m 空间系列圆心的平均值，即转轴方程的常量
[Xt,Yt,Zt,T]=calcuXYZt(Y,m);

%计算相机坐标系下转台坐标系三个轴所在的方向向量
R1=calcuR1(Yt,Xt);

%相机下的两轴分别和转台下对应的轴对齐得到两个坐标系之间的旋转矩阵
n=40;%外形图片数量

A=Mangle(n);%产生转台坐标系下的旋转角度
P=[];
B=[];
G=[];
for j=1:n
%eval(['o','=','a',num2str(j),';']);
o=A(j,:);
%I=eye(3,3);
R2=[cos(o) 0 -sin(o)
    0      1    0   
    sin(o)  0    cos(o)];%绕转台Y轴旋转产生的旋转矩阵

R11=inv(R1);%R1求逆 对应的旋转矩阵

%旋转矩阵的验证 ： 旋转矩阵的转置 和旋转矩阵的逆相等
E=[R2*R11 T'];%%%%外参%%%

P1=K*E;%投影矩阵

P{1,j}=P1;
B{1,j}=K;
G{1,j}=E;
end
save dino_Ps.mat P
txtprintf('K:/result/biaoding_2022_1_15',P,n)
%txt2printf('D:/pic/document/waican',B,G,20)

